Revit 2022 API
EnergyAnalysisSpace.Area Property
 The area for this space.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2012
Syntax
C#
public double Area { get; }
Visual Basic
Public ReadOnly Property Area As Double
	Get
Visual C++
public:
property double Area {
	double get ();
}
Remarks
 This value is the enclosed area measured by interior bounding surfaces.
See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace